<template>
	<div class="container" data-spy="scroll" data-target="#mynavbar">
		<h1 class="page-header">javascript插件</h1>
		<h3>弹窗</h3>
		<div>
			<button class="btn btn-primary btn-lg" data-toggle="modal" data-target="#mymodal"  >alert modal</button>
		</div>
		<div id="mymodal" ref="mymodal" class="modal fade ">
			<div class="modal-dialog modal-sm">
				<div class="modal-content">
					<div class="modal-header">
						<span class="close" data-dismiss="modal">&times;</span>
						<h4>JavaScript ,vue</h4>
					</div>
					<div class="modal-body">
						modal-body    JavaScript is very good,l like it;JavaScript is very good,l like it;JavaScript is very good,l like it;
					</div>
					<div class="modal-footer">
						<button class="btn btn-default" data-dismiss="modal">close</button>
						<button class="btn" :class="saveBtn" @click="alertSave()">save</button>
					</div> 
				</div>
			</div>
		</div>
		
		
		
		
		<h3>滚动监听</h3>
		<nav class="navbar navbar-inverse" id="mynavbar">
		  <div class="container-fluid">
			<!-- Brand and toggle get grouped for better mobile display -->
			<div class="navbar-header">
			  <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
				<span class="sr-only">Toggle navigation</span>
				<span class="icon-bar"></span>
				<span class="icon-bar"></span>
				<span class="icon-bar"></span>
			  </button>
			  <a class="navbar-brand" href="#">Brand</a>
			</div>

			<!-- Collect the nav links, forms, and other content for toggling -->
			<div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
			  <ul class="nav navbar-nav">
				  <li class="active"><a href="#food2">吃</a></li>
				  <li><a href="#drink2">喝</a></li>
				  <li><a href="#play2">玩</a></li>
				  <li><a href="#happy2">乐</a></li>
			  </ul>
			</div><!-- /.navbar-collapse -->
		  </div><!-- /.container-fluid -->
		</nav>
		<div class="panel panel-primary">
			<div class="panel-heading">
				<div class="panel-title" id="food2">
					<h3>吃</h3>
				</div>
			</div>
			<div class="panel-body">
				吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
			</div>
		</div>
		<div class="panel panel-primary">
			<div class="panel-heading">
				<div class="panel-title" id="drink2">
					<h3>喝</h3>
				</div>
			</div>
			<div class="panel-body">
				喝是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				喝是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				喝是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				喝是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				喝是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
			</div>
		</div>
		<div class="panel panel-primary">
			<div class="panel-heading">
				<div class="panel-title" id="play2">
					<h3>玩</h3>
				</div>
			</div>
			<div class="panel-body">
				玩是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				玩是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				玩是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				玩是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				玩是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
			</div>
		</div>
		<div class="panel panel-primary">
			<div class="panel-heading">
				<div class="panel-title" id="happy2">
					<h3>乐</h3>
				</div>
			</div>
			<div class="panel-body">
				乐是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				乐是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				乐是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				乐是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
				乐是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。吃是一门享受，吃好活好，一辈子不后悔。
			</div>
		</div>
	</div>
</template>

<script>
	export default{
		name:'login',
		data:function(){
			return {
				saveBtn:{
					'btn-primary':true
				}
			}
		},
		methods:{
			alertSave:function(){
				alert('save success!');
				// console.log(this.$refs);
				// this.$refs.aa.innerText='aaaa';
				$('#mymodal').modal('hide');
			},
		},
		mounted:function(){
			$('#mymodal').on('hidden.bs.modal', function (e) {
			  // alert('1');
			});
			$('body').scrollspy({ target: '#mynavbar' })
		},
	}
</script>

<style scoped="">
	.container {
		position: relative;
	}
	#mynavbar{
		position: fixed;
		top: 200px;
		width: 100%;
	}
	

</style>
